<a href="https://colab.research.google.com/github/unknown-jun/Basic_of_Python/blob/master/Pandas_Functions.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np

# 데이터 프레임 만들기

- 문법:  
~~~
변수명 = pd.DataFrame(
    { '컬럼명1' : ['데이터1', '데이터2'], 
      '컬럼명2' : ['데이터'] }
                             )
~~~

In [2]:
data_frame = pd.DataFrame(
    { 'name' : ['John', 'Jenny', 'Nate', 'Julia', 'Brian', 'Chris'],
      'age'  : [20, 30, 30, 40, 45, 25],
      'job'  : ['student', 'developer', 'teacher', 'dentist', 'manager', 'intern'] }
                          )

In [3]:
data_frame

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [4]:
data_frame.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager

In [5]:
data_frame.tail()

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

# 시리즈란
- Dataframe의 구성요소
- Serise가 모여서 Dataframe을 만듦

In [6]:
type(data_frame.age)

pandas.core.series.Series

In [7]:
list_tmp = [1,2,3]

In [8]:
a1 = pd.core.series.Series( [1,2,3] )

In [9]:
a2 = pd.core.series.Series( ['one', 'two', 'three'] )

In [10]:
a3=pd.DataFrame( data = dict(name=a1, word=a2) )
a3

   name   word
0     1    one
1     2    two
2     3  three

# 파일에서 데이터 불러오기

In [11]:
df = pd.read_csv('friend_list.csv')
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [12]:
df = pd.read_csv('friend_list.txt')
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [13]:
df = pd.read_csv('friend_list_tab.txt')
df

         name\tage\tjob
0     John\t20\tstudent
1  Jenny\t30\tdeveloper
2     Nate\t30\tteacher
3    Julia\t40\tdentist
4    Brian\t45\tmanager
5     Chris\t25\tintern

In [14]:
df = pd.read_csv('friend_list_tab.txt', delimiter = '\t')
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [15]:
df = pd.read_csv('friend_list_no_head.csv')
df

    John  20    student
0  Jenny  30  developer
1   Nate  30    teacher
2  Julia  40    dentist
3  Brian  45    manager
4  Chris  25     intern

In [16]:
df = pd.read_csv('friend_list_no_head.csv', header=None)
df

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher
3  Julia  40    dentist
4  Brian  45    manager
5  Chris  25     intern

In [17]:
df.columns = ['name', 'age', 'job']
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [18]:
df = pd.read_csv('friend_list_no_head.csv', 
                 header=None, names=['name', 'age', 'job'])
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

# 데이터 프레임 생성하기

In [19]:
friend_dict_list = [
    {'name':'John', 'age':25, 'job':'student'},
    {'name':'Nate', 'age':30, 'job':'teacher'}
]

In [20]:
df=pd.DataFrame(friend_dict_list)
df.head()

   name  age      job
0  John   25  student
1  Nate   30  teacher

In [21]:
df=df[['name', 'job', 'age']]
df.head()

   name      job  age
0  John  student   25
1  Nate  teacher   30

In [22]:
from collections import OrderedDict

In [23]:
friend_ordered_dict = OrderedDict(
    [
     ('name',['John', 'Nate']),
     ('age',[25, 30]),
     ('job',['student', 'teacher'])
    ]
)

In [24]:
df = pd.DataFrame.from_dict(friend_ordered_dict)
df.head()

   name  age      job
0  John   25  student
1  Nate   30  teacher

In [25]:
friend_list = [
    ['Johb', 20, 'student'],
    ['Nate', 30, 'teacher']
]

In [26]:
column_name = ['name', 'age', 'job']

df = pd.DataFrame.from_records(friend_list, columns = column_name)
df.head()

   name  age      job
0  Johb   20  student
1  Nate   30  teacher

# 데이터 프레임 파일로 저장하기 (to_csv)

In [27]:
friends = [
    {'name':'Jone', 'age':20, 'job':'student'},
    {'name':'Jenny', 'age':30, 'job':None},
    {'name':'Nate', 'age':30, 'job':'teacher'}
    ]
df = pd.DataFrame(friends)
df=df[['name', 'age', 'job']]

In [28]:
df.head()

    name  age      job
0   Jone   20  student
1  Jenny   30     None
2   Nate   30  teacher

In [29]:
df.to_csv('friends.csv', index=False, header=True)

In [30]:
df=pd.read_csv("friends.csv")
df

    name  age      job
0   Jone   20  student
1  Jenny   30      NaN
2   Nate   30  teacher

In [31]:
df.to_csv('friends.csv', index=True)

In [32]:
df=pd.read_csv("friends.csv")
df

   Unnamed: 0   name  age      job
0           0   Jone   20  student
1           1  Jenny   30      NaN
2           2   Nate   30  teacher

In [33]:
df.to_csv('friends.csv', index=False, header=False)

In [34]:
df

   Unnamed: 0   name  age      job
0           0   Jone   20  student
1           1  Jenny   30      NaN
2           2   Nate   30  teacher

In [35]:
df.to_csv('friends.csv', index=False, header=False, na_rep='-')

In [36]:
df

   Unnamed: 0   name  age      job
0           0   Jone   20  student
1           1  Jenny   30      NaN
2           2   Nate   30  teacher

# 데이터프레임 행, 열 선택 및 필터하기

In [37]:
df = pd.DataFrame(
    {'name': ['John', 'Jenny', 'Nate'],
    'age': [20, 30, 30],
    'job': ['student', 'developer', 'teacher']}
)

df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [38]:
df[1:3]

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [39]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

앞의 df[1:3]이 적용되지 않았다  
이를 적용하기 위해선

In [40]:
df = df[1:3]
df

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [41]:
df = pd.DataFrame(
    {'name': ['John', 'Jenny', 'Nate'],
    'age': [20, 30, 30],
    'job': ['student', 'developer', 'teacher']}
)

df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [42]:
df.loc[[0,2]]

   name  age      job
0  John   20  student
2  Nate   30  teacher

In [43]:
df = df.loc[[0,2]]
df

   name  age      job
0  John   20  student
2  Nate   30  teacher

In [44]:
df = pd.DataFrame(
    {'name': ['John', 'Jenny', 'Nate'],
    'age': [20, 30, 30],
    'job': ['student', 'developer', 'teacher']}
)

df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

##by column condition

In [45]:
df[df.age > 25]

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [46]:
df.query('age>25')

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [47]:
df[(df.age>25) & (df.name =='Nate')]

   name  age      job
2  Nate   30  teacher

##Filter column

by index

In [48]:
friend_list = [
    ['John', 20, 'student'],
    ['Jenny', 30, 'developer'],
    ['Nate', 30, 'teacher']
]

df = pd.DataFrame.from_records(friend_list)
df

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher

In [49]:
df.iloc[:,0:2]

       0   1
0   John  20
1  Jenny  30
2   Nate  30

In [50]:
df.iloc[0:2,0:2]

       0   1
0   John  20
1  Jenny  30

## by column name

In [51]:
df = pd.read_csv('friend_list_no_head.csv', header=None, names=['name', 'age', 'job'])
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [52]:
df_filtered = df[['name', 'age']]
df_filtered

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [53]:
df.filter(items=['age', 'job'])

   age        job
0   20    student
1   30  developer
2   30    teacher
3   40    dentist
4   45    manager
5   25     intern

In [54]:
df.filter(like='a', axis=1)

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [55]:
df.filter(regex='b$', axis=1)

         job
0    student
1  developer
2    teacher
3    dentist
4    manager
5     intern

In [56]:
df.filter(regex='e$', axis=1)

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

# 데이터프레임 행, 열 삭제하기 (drop row, column)

In [57]:
friends=[{'age':15, 'job':'student'},
         {'age':25, 'job':'developer'},
         {'age':30, 'job':'teacher'}]

df = pd.DataFrame(friends,
                  index = ['John', 'Jenny', 'Nate'],
                  columns = ['age', 'job'])
df

       age        job
John    15    student
Jenny   25  developer
Nate    30    teacher

In [58]:
df.drop(['John', 'Nate'])

       age        job
Jenny   25  developer

In [59]:
df = df.drop(['John', 'Nate'])
df

       age        job
Jenny   25  developer

In [60]:
friends=[{'age':15, 'job':'student'},
         {'age':25, 'job':'developer'},
         {'age':30, 'job':'teacher'}]

df = pd.DataFrame(friends,
                  index = ['John', 'Jenny', 'Nate'],
                  columns = ['age', 'job'])
df

       age        job
John    15    student
Jenny   25  developer
Nate    30    teacher

In [61]:
df.drop(['John', 'Nate'], inplace=True)
df

       age        job
Jenny   25  developer

In [62]:
friends=[{'name':'John','age':15, 'job':'student'},
         {'name':'Ben','age':25, 'job':'developer'},
         {'name':'Jenny','age':30,'job':'teacher'}]

df = pd.DataFrame(friends,
                  columns = ['name','age', 'job'])
df

    name  age        job
0   John   15    student
1    Ben   25  developer
2  Jenny   30    teacher

In [63]:
df = df.drop(df.index[[0,2]])
df

  name  age        job
1  Ben   25  developer

In [64]:
df = pd.DataFrame(friends,
                  columns = ['name','age', 'job'])
df

    name  age        job
0   John   15    student
1    Ben   25  developer
2  Jenny   30    teacher

In [65]:
df = df[ df['age'] > 20 ]
df

    name  age        job
1    Ben   25  developer
2  Jenny   30    teacher

In [66]:
df = pd.DataFrame(friends,
                  columns = ['name','age', 'job'])
df

    name  age        job
0   John   15    student
1    Ben   25  developer
2  Jenny   30    teacher

In [67]:
df = df.drop('age', axis=1)
df

    name        job
0   John    student
1    Ben  developer
2  Jenny    teacher

In [68]:
df = pd.DataFrame(friends,
                  columns = ['name','age', 'job'])
df

    name  age        job
0   John   15    student
1    Ben   25  developer
2  Jenny   30    teacher

In [69]:
df.drop('age', axis=1, inplace=True)
df

    name        job
0   John    student
1    Ben  developer
2  Jenny    teacher

# 행, 열 생성 및 수정하기

- 열 생성: df [ '컬럼명' ] = 값
- 조건을 줘서 수정: df [ '컬럼명' ] = np.where( df [ '컬럼명' ] != '조건', '변경 후', '변경 전' )

In [70]:
friend_dict_list = [
        {'name':'John', 'age':15, 'job':'student'},
        {'name':'Jenny', 'age':30, 'job':'developer'},
        {'name':'Nate', 'age':30, 'job':'teacher'}
                    ]
                    
df = pd.DataFrame(friend_dict_list, columns=['name', 'age', 'job'])

In [71]:
df.head()

    name  age        job
0   John   15    student
1  Jenny   30  developer
2   Nate   30    teacher

In [72]:
df['salary'] = 0

In [73]:
df.head()

    name  age        job  salary
0   John   15    student       0
1  Jenny   30  developer       0
2   Nate   30    teacher       0

In [74]:
df['salary']=np.where(df['job'] != 'student', 'yes', 'no')

In [75]:
df.head()

    name  age        job salary
0   John   15    student     no
1  Jenny   30  developer    yes
2   Nate   30    teacher    yes

In [76]:
friend_dict_list = [{'name':'John', 'midterm':95, 'final':85},
                    {'name':'Jenny', 'midterm':85, 'final':80},
                    {'name':'Nate', 'midterm':30, 'final':10}]

df = pd.DataFrame(friend_dict_list, columns=['name', 'midterm', 'final'])

df

    name  midterm  final
0   John       95     85
1  Jenny       85     80
2   Nate       30     10

In [77]:
df['total'] = df['midterm'] + df['final']
df.head()

    name  midterm  final  total
0   John       95     85    180
1  Jenny       85     80    165
2   Nate       30     10     40

In [78]:
df['average'] = df['total']/2
df.head()

    name  midterm  final  total  average
0   John       95     85    180     90.0
1  Jenny       85     80    165     82.5
2   Nate       30     10     40     20.0

In [79]:
grades = [ ]

for row in df['average']:
    if row >= 90:
        grades.append('A')
    elif row >= 80:
        grades.append('B')
    else:
        grades.append('F')

df['grade'] = grades

df.head()

    name  midterm  final  total  average grade
0   John       95     85    180     90.0     A
1  Jenny       85     80    165     82.5     B
2   Nate       30     10     40     20.0     F

In [80]:
def pass_or_fail(row):
    if row != 'F':
        return 'Pass'
    else:
        return 'Fail'

df['grade'] = df['grade'].apply(pass_or_fail)
df.head()

    name  midterm  final  total  average grade
0   John       95     85    180     90.0  Pass
1  Jenny       85     80    165     82.5  Pass
2   Nate       30     10     40     20.0  Fail

In [81]:
date_list = [
    {
        'yyyy-mm-dd':'2000-06-27'
    },
    
    {
        'yyyy-mm-dd':'2007-10-27'
    }
]

df = pd.DataFrame(date_list, columns=['yyyy-mm-dd'])

df.head()

   yyyy-mm-dd
0  2000-06-27
1  2007-10-27

In [82]:
def extract_year(row):
    return row.split('-')[0]

df['year'] = df['yyyy-mm-dd'].apply(extract_year)

df.head()

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2007-10-27  2007

In [83]:
friend_dict_list = [{'name':'John', 'midterm':95, 'final':85},
                    {'name':'Jenny', 'midterm':85, 'final':80},
                    {'name':'Nate', 'midterm':30, 'final':10}]

df = pd.DataFrame(friend_dict_list, columns=['name', 'midterm', 'final'])

df

    name  midterm  final
0   John       95     85
1  Jenny       85     80
2   Nate       30     10

In [84]:
df2 = pd.DataFrame([
    ['Ben', 50, 50]
], columns = ['name', 'midterm', 'final'])
df2.head()

  name  midterm  final
0  Ben       50     50

In [85]:
df.append(df2, ignore_index = True)
df

    name  midterm  final
0   John       95     85
1  Jenny       85     80
2   Nate       30     10

# 데이터 그룹 만들기 (group by)

In [86]:
student_list = [{'name': 'John', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Nate', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Abraham', 'major': "Physics", 'sex': "male"},
                {'name': 'Brian', 'major': "Psychology", 'sex': "male"},
                {'name': 'Janny', 'major': "Economics", 'sex': "female"},
                {'name': 'Yuna', 'major': "Economics", 'sex': "female"},
                {'name': 'Jeniffer', 'major': "Computer Science", 'sex': "female"},
                {'name': 'Edward', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Zara', 'major': "Psychology", 'sex': "female"},
                {'name': 'Wendy', 'major': "Economics", 'sex': "female"},
                {'name': 'Sera', 'major': "Psychology", 'sex': "female"}
         ]
df = pd.DataFrame(student_list, columns = ['name', 'major', 'sex'])
df

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

In [87]:
groupby_major = df.groupby('major')
groupby_major.groups

{'Computer Science': [0, 1, 6, 7], 'Economics': [4, 5, 9], 'Physics': [2], 'Psychology': [3, 8, 10]}

In [88]:
for name, group in groupby_major:
    print(name + ' : ' +str(len(group)))
    print(group)
    print()

Computer Science : 4
       name             major     sex
0      John  Computer Science    male
1      Nate  Computer Science    male
6  Jeniffer  Computer Science  female
7    Edward  Computer Science    male

Economics : 3
    name      major     sex
4  Janny  Economics  female
5   Yuna  Economics  female
9  Wendy  Economics  female

Physics : 1
      name    major   sex
2  Abraham  Physics  male

Psychology : 3
     name       major     sex
3   Brian  Psychology    male
8    Zara  Psychology  female
10   Sera  Psychology  female

In [89]:
df_major_cnt = pd.DataFrame({'count':groupby_major.size()}).reset_index()
df_major_cnt

              major  count
0  Computer Science      4
1         Economics      3
2           Physics      1
3        Psychology      3

In [90]:
groupby_sex = df.groupby('sex')

In [91]:
for name, sex in groupby_sex:
    print(name + ' : ' +str(len(sex)))
    print(sex)
    print()

female : 6
        name             major     sex
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

male : 5
      name             major   sex
0     John  Computer Science  male
1     Nate  Computer Science  male
2  Abraham           Physics  male
3    Brian        Psychology  male
7   Edward  Computer Science  male

# 중복 데이터 삭제하기 (drop duplicates)

In [92]:
student_list = [{'name': 'John', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Nate', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Abraham', 'major': "Physics", 'sex': "male"},
                {'name': 'Brian', 'major': "Psychology", 'sex': "male"},
                {'name': 'Janny', 'major': "Economics", 'sex': "female"},
                {'name': 'Yuna', 'major': "Economics", 'sex': "female"},
                {'name': 'Jeniffer', 'major': "Computer Science", 'sex': "female"},
                {'name': 'Edward', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Zara', 'major': "Psychology", 'sex': "female"},
                {'name': 'Wendy', 'major': "Economics", 'sex': "female"},
                {'name': 'Sera', 'major': "Psychology", 'sex': "female"},
                {'name': 'John', 'major': "Computer Science", 'sex': "male"},
         ]
df = pd.DataFrame(student_list, columns = ['name', 'major', 'sex'])
df

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female
11      John  Computer Science    male

In [93]:
df.duplicated()

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11     True
dtype: bool

In [94]:
df.drop_duplicates()

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

In [95]:
student_list = [{'name': 'John', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Nate', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Abraham', 'major': "Physics", 'sex': "male"},
                {'name': 'Brian', 'major': "Psychology", 'sex': "male"},
                {'name': 'Janny', 'major': "Economics", 'sex': "female"},
                {'name': 'Yuna', 'major': "Economics", 'sex': "female"},
                {'name': 'Jeniffer', 'major': "Computer Science", 'sex': "female"},
                {'name': 'Edward', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Zara', 'major': "Psychology", 'sex': "female"},
                {'name': 'Wendy', 'major': "Economics", 'sex': "female"},
                {'name': 'Nate', 'major': None, 'sex': "male"},
                {'name': 'John', 'major': "Computer Science", 'sex': None},
         ]
df = pd.DataFrame(student_list, columns = ['name', 'major', 'sex'])
df

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Nate              None    male
11      John  Computer Science    None

In [96]:
df.duplicated()

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
dtype: bool

모두가 False인 이유는 정확하기 일치하는 row가 없어서임

In [97]:
df.duplicated('name')

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10     True
11     True
dtype: bool

In [98]:
df.drop_duplicates(['name'], keep='first') # keep의 default 값은 'first'

       name             major     sex
0      John  Computer Science    male
1      Nate  Computer Science    male
2   Abraham           Physics    male
3     Brian        Psychology    male
4     Janny         Economics  female
5      Yuna         Economics  female
6  Jeniffer  Computer Science  female
7    Edward  Computer Science    male
8      Zara        Psychology  female
9     Wendy         Economics  female

In [99]:
df.drop_duplicates(['name'], keep='last')

        name             major     sex
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Nate              None    male
11      John  Computer Science    None

# None 처리하기

In [100]:
school_id_list = [{'name': 'John', 'job': "teacher", 'age': 40},
                {'name': 'Nate', 'job': "teacher", 'age': 35},
                {'name': 'Yuna', 'job': "teacher", 'age': 37},
                {'name': 'Abraham', 'job': "student", 'age': 10},
                {'name': 'Brian', 'job': "student", 'age': 12},
                {'name': 'Janny', 'job': "student", 'age': 11},
                {'name': 'Nate', 'job': "teacher", 'age': None},
                {'name': 'John', 'job': "student", 'age': None}
         ]
df = pd.DataFrame(school_id_list, columns = ['name', 'job', 'age'])
df

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Janny  student  11.0
6     Nate  teacher   NaN
7     John  student   NaN

In [101]:
df.shape

(8, 3)

In [102]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    8 non-null      object
 1   job     8 non-null      object
 2   age     6 non-null      float64
dtypes: float64(1), object(2)
memory usage: 320.0+ bytes

In [103]:
df.isna()

    name    job    age
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5  False  False  False
6  False  False   True
7  False  False   True

In [104]:
df.isnull()

    name    job    age
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5  False  False  False
6  False  False   True
7  False  False   True

In [105]:
df['age'] = df['age'].fillna(0)
df

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Janny  student  11.0
6     Nate  teacher   0.0
7     John  student   0.0

In [106]:
school_id_list = [{'name': 'John', 'job': "teacher", 'age': 40},
                {'name': 'Nate', 'job': "teacher", 'age': 35},
                {'name': 'Yuna', 'job': "teacher", 'age': 37},
                {'name': 'Abraham', 'job': "student", 'age': 10},
                {'name': 'Brian', 'job': "student", 'age': 12},
                {'name': 'Janny', 'job': "student", 'age': 11},
                {'name': 'Nate', 'job': "teacher", 'age': None},
                {'name': 'John', 'job': "student", 'age': None}
         ]
df = pd.DataFrame(school_id_list, columns = ['name', 'job', 'age'])
df

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Janny  student  11.0
6     Nate  teacher   NaN
7     John  student   NaN

In [107]:
df['age'].fillna(df.groupby('job')['age'].transform('median'), inplace=True)
df

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Janny  student  11.0
6     Nate  teacher  37.0
7     John  student  11.0

# apply 함수, 예제로 활용하기

In [108]:
date_list = [{'yyyy-mm-dd': '2000-06-27'},
         {'yyyy-mm-dd': '2002-09-24'},
         {'yyyy-mm-dd': '2005-12-20'}]
df = pd.DataFrame(date_list, columns = ['yyyy-mm-dd'])
df

   yyyy-mm-dd
0  2000-06-27
1  2002-09-24
2  2005-12-20

In [109]:
def extract_year(column):
    return column.split("-")[0]

df['year'] = df['yyyy-mm-dd'].apply(extract_year)
df

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2002-09-24  2002
2  2005-12-20  2005

In [110]:
def get_age(year, current_year):
    return current_year - int(year)

df['age'] = df['year'].apply(get_age, current_year=2021)
df

   yyyy-mm-dd  year  age
0  2000-06-27  2000   21
1  2002-09-24  2002   19
2  2005-12-20  2005   16

In [111]:
def get_introduce(age, prefix, suffix):
    return prefix + str(age) + suffix

df['introduce'] = df['age'].apply(get_introduce, 
                                  prefix="I am ", suffix = " years old")
df

   yyyy-mm-dd  year  age          introduce
0  2000-06-27  2000   21  I am 21 years old
1  2002-09-24  2002   19  I am 19 years old
2  2005-12-20  2005   16  I am 16 years old

In [112]:
def get_introduce2 (row):
    return "I was born in " + str(row.year) + " my age is " + str(row.age)

df['introduce2'] = df.apply(get_introduce2, axis=1)
df

   yyyy-mm-dd  year  age          introduce                       introduce2
0  2000-06-27  2000   21  I am 21 years old  I was born in 2000 my age is 21
1  2002-09-24  2002   19  I am 19 years old  I was born in 2002 my age is 19
2  2005-12-20  2005   16  I am 16 years old  I was born in 2005 my age is 16

# map, applymap 함수, 다양한 예제로 활용해보기

In [113]:
date_list = [{'date': '2000-06-27'},
         {'date': '2002-09-24'},
         {'date': '2005-12-20'}]
df = pd.DataFrame(date_list, columns = ['date'])
df

         date
0  2000-06-27
1  2002-09-24
2  2005-12-20

In [114]:
def extract_year(date):
    return date.split('-')[0]

df['year']=df['date'].map(extract_year)
df

         date  year
0  2000-06-27  2000
1  2002-09-24  2002
2  2005-12-20  2005

In [115]:
job_list = [{'age': 20, 'job': 'student'},
         {'age': 30, 'job': 'developer'},
         {'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(job_list)
df

   age        job
0   20    student
1   30  developer
2   30    teacher

In [116]:
df.job = df.job.map({'student':1, 'developer':2, 'teacher':3})
df

   age  job
0   20    1
1   30    2
2   30    3

In [117]:
x_y = [{'x': 5.5, 'y': -5.6, 'z':-1.1},
         {'x': -5.2, 'y': 5.5, 'z':-2.2},
         {'x': -1.6, 'y': -4.5, 'z':-3.3}]
df = pd.DataFrame(x_y)
df

     x    y    z
0  5.5 -5.6 -1.1
1 -5.2  5.5 -2.2
2 -1.6 -4.5 -3.3

모든 테이블에 함수를 적용시키고 싶을 때 => df.applymap(함수)

In [118]:
df = df.applymap(np.around)
df

     x    y    z
0  6.0 -6.0 -1.0
1 -5.0  6.0 -2.0
2 -2.0 -4.0 -3.0

#unique, value_counts 컬럼 내 유니크한 값 뽑아내고 갯수 확인하기

In [119]:
job_list = [{'name': 'John', 'job': "teacher"},
                {'name': 'Nate', 'job': "teacher"},
                {'name': 'Fred', 'job': "teacher"},
                {'name': 'Abraham', 'job': "student"},
                {'name': 'Brian', 'job': "student"},
                {'name': 'Janny', 'job': "developer"},
                {'name': 'Nate', 'job': "teacher"},
                {'name': 'Obrian', 'job': "dentist"},
                {'name': 'Yuna', 'job': "teacher"},
                {'name': 'Rob', 'job': "lawyer"},
                {'name': 'Brian', 'job': "student"},
                {'name': 'Matt', 'job': "student"},
                {'name': 'Wendy', 'job': "banker"},
                {'name': 'Edward', 'job': "teacher"},
                {'name': 'Ian', 'job': "teacher"},
                {'name': 'Chris', 'job': "banker"},
                {'name': 'Philip', 'job': "lawyer"},
                {'name': 'Janny', 'job': "basketball player"},
                {'name': 'Gwen', 'job': "teacher"},
                {'name': 'Jessy', 'job': "student"}
         ]
df = pd.DataFrame(job_list, columns = ['name', 'job'])

df

       name                job
0      John            teacher
1      Nate            teacher
2      Fred            teacher
3   Abraham            student
4     Brian            student
5     Janny          developer
6      Nate            teacher
7    Obrian            dentist
8      Yuna            teacher
9       Rob             lawyer
10    Brian            student
11     Matt            student
12    Wendy             banker
13   Edward            teacher
14      Ian            teacher
15    Chris             banker
16   Philip             lawyer
17    Janny  basketball player
18     Gwen            teacher
19    Jessy            student

In [120]:
df['job'].unique()

array(['teacher', 'student', 'developer', 'dentist', 'lawyer', 'banker',
       'basketball player'], dtype=object)

In [121]:
df['job'].value_counts()

teacher              8
student              5
banker               2
lawyer               2
dentist              1
developer            1
basketball player    1
Name: job, dtype: int64

# 두개의 데이터프레임 합치기

In [122]:
l1 = [{'name': 'John', 'job': "teacher"},
      {'name': 'Nate', 'job': "student"},
      {'name': 'Fred', 'job': "developer"}]

l2 = [{'name': 'Ed', 'job': "dentist"},
      {'name': 'Jack', 'job': "farmer"},
      {'name': 'Ted', 'job': "designer"}]
         
l3 = [{'name': 'John', 'job': "teacher"},
      {'name': 'Nate', 'job': "student"},
      {'name': 'Fred', 'job': "developer"}]

l4 = [{'age':25, 'country':'U.S'},
      {'age':30, 'country':'U.K'},
      {'age':45, 'country':'Korea'}]

df1 = pd.DataFrame(l1, columns = ['name', 'job'])
df2 = pd.DataFrame(l2, columns = ['name', 'job'])

In [123]:
df1

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer

In [124]:
df2

   name       job
0    Ed   dentist
1  Jack    farmer
2   Ted  designer

In [125]:
result = pd.concat([df1, df2])
result

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer
0    Ed    dentist
1  Jack     farmer
2   Ted   designer

In [126]:
result = pd.concat([df1, df2], ignore_index=True)
result

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer
3    Ed    dentist
4  Jack     farmer
5   Ted   designer

In [127]:
result1 = df1.append(df2, ignore_index=True)
result1

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer
3    Ed    dentist
4  Jack     farmer
5   Ted   designer

##열로 합치기

In [128]:
df1 = pd.DataFrame(data=l3)
df2 = pd.DataFrame(data=l4)

In [129]:
df1

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer

In [130]:
df2

   age country
0   25     U.S
1   30     U.K
2   45   Korea

In [131]:
result = pd.concat([df1, df2], axis=1, ignore_index=True)
result

      0          1   2      3
0  John    teacher  25    U.S
1  Nate    student  30    U.K
2  Fred  developer  45  Korea

In [132]:
label = [1,2,3,4,5]
prediction = [1,2,2,4,4]

In [133]:
comparison = pd.DataFrame({'lable1':label, 'prediction':prediction})
comparison

   lable1  prediction
0       1           1
1       2           2
2       3           2
3       4           4
4       5           4